@matttrach as I initially went to reproduce this behavior on Rancher v2.8.2 with Rancher2 provider 4.0.0, RKE2/K3s provided the following `terraform plan`:

```
+ resource "rancher2_machine_config_v2" "machine_config" {
      + annotations      = (known after apply)
      + fleet_namespace  = "fleet-default"
      + generate_name    = "howdy"
      + id               = (known after apply)
      + kind             = (known after apply)
      + labels           = (known after apply)
      + name             = (known after apply)
      + resource_version = (known after apply)

      + vsphere_config {
          + cfgparam          = [
              + "disk.enableUUID=TRUE",
            ]
          + clone_from        = "<redacted>"
          + cloudinit         = <<-EOT
                #cloud-config
            EOT
          + content_library   = "<redacted>"
          + cpu_count         = "4"
          + creation_type     = "template"
          + datacenter        = "<redacted>"
          + datastore         = "<redacted>"
          + disk_size         = "40000"
          + folder            = "<redacted>"
          + hostsystem        = "<redacted>"
          + memory_size       = "4096"
          + network           = [
              + "<redacted>",
            ]
          + pool              = "<redacted>"
          + ssh_password      = (sensitive value)
          + ssh_port          = "22"
          + ssh_user          = "docker"
          + ssh_user_group    = "staff"
          + vcenter_port      = "443"
            # (3 unchanged attributes hidden)
        }
    }

```
I expected to have seen `creation _type = legacy`, which was not here. When I went to test on the latest commit on `main` for Rancher, I saw the exact same `terraform plan` output.

At this time, it appears that I am seeing `creation_type = template` at both instances of Rancher. I looked into the SURE issue for further context, and through my testing, this may have been a one-off issue the customer was facing.